[
  {
    "message": "You yourself must strive. The Buddhas only point the way.",
    "citation": "Maggavagga: The Path"
  },
  {
    "message": "Those who mistake the unessential to be essential and the essential to be unessential, dwelling in wrong thoughts, never arrive at the essential.",
    "citation": "Yamakavagga: Pairs"
  },
  {
    "message": "Whoever doesn’t flare up at someone who’s angry wins a battle hard to win.",
    "citation": "Akkosa Sutta: Insult"
  },
  {
    "message": "Just as rain does not break through a well-thatched house, so passion never penetrates a well-developed mind.",
    "citation": "Akkosa Sutta: Insult"
  },
  {
    "message": "Some do not understand that we must die, But those who do realize this settle their quarrels.",
    "citation": "Yamakavagga: Pairs"
  },
  {
    "message": "Whatever is not yours: let go of it. Your letting go of it will be for your long-term happiness & benefit.",
    "citation": "Na Tumhaka Sutta: Not Yours"
  },
  {
    "message": "Speak only endearing speech, speech that is welcomed. Speech, when it brings no evil to others, is a pleasant thing.",
    "citation": "Subhasita Sutta: Well-Spoken"
  },
  {
    "message": "Ardently do today what must be done. Who knows? Tomorrow, death comes.",
    "citation": "Bhaddekaratta Sutta: An Auspicious Day"
  },
  {
    "message": "The good renounce (attachment for) everything. The virtuous do not prattle with a yearning for pleasures. The wise show no elation or depression when touched by happiness or sorrow.",
    "citation": "Panditavagga: The Wise"
  },
  {
    "message": " Calm is his thought, calm his speech, and calm his deed, who, truly knowing, is wholly freed, perfectly tranquil and wise.",
    "citation": "Arahantavagga: The Arahant or Perfected One"
  },
  {
    "message": "Better it is to live one day virtuous and meditative than to live a hundred years immoral and uncontrolled.",
    "citation": "Sahassavagga: The Thousands"
  },
  {
    "message": "Better it is to live one day wise and meditative than to live a hundred years foolish and uncontrolled.",
    "citation": "Sahassavagga: The Thousands"
  },
  {
    "message": "Better it is to live one day strenuous and resolute than to live a hundred years sluggish and dissipated.",
    "citation": "Sahassavagga: The Thousands"
  },
  {
    "message": "Better it is to live one day seeing the rise and fall of things than to live a hundred years without ever seeing the rise and fall of things.",
    "citation": "Sahassavagga: The Thousands"
  },
  {
    "message": "All tremble at violence; all fear death. Putting oneself in the place of another, one should not kill nor cause another to kill.",
    "citation": "Dandavagga: Violence"
  },
  {
    "message": "All tremble at violence; life is dear to all. Putting oneself in the place of another, one should not kill nor cause another to kill.",
    "citation": "Dandavagga: Violence"
  },
  {
    "message": "One who, while himself seeking happiness, does not oppress with violence other beings who also desire happiness, will find happiness hereafter.",
    "citation": "Dandavagga: Violence"
  },
  {
    "message": "To avoid all evil, to cultivate good, and to cleanse one's mind — this is the teaching of the Buddhas.",
    "citation": "Buddhavagga: The Buddha"
  },
  {
    "message": "He who checks rising anger as a charioteer checks a rolling chariot, him I call a true charioteer. Others only hold the reins.",
    "citation": "Kodhavagga: Anger"
  },
  {
    "message": "Overcome the angry by non-anger; overcome the wicked by goodness; overcome the miser by generosity; overcome the liar by truth.",
    "citation": "Kodhavagga: Anger"
  },
  {
    "message": "Let a man guard himself against irritability in speech; let him be controlled in speech. Abandoning verbal misconduct, let him practice good conduct in speech.",
    "citation": "Kodhavagga: Anger"
  },
  {
    "message": "Let a man guard himself against irritability in thought; let him be controlled in mind. Abandoning mental misconduct, let him practice good conduct in thought.",
    "citation": "Kodhavagga: Anger"
  },
  {
    "message": "One is not wise because one speaks much. He who is peaceable, friendly and fearless is called wise.",
    "citation": "Dhammatthavagga: The Just"
  },
  {
    "message": "You yourselves must strive; the Buddhas only point the way. Those meditative ones who tread the path are released from the bonds of Mara.",
    "citation": "Maggavagga: The Path"
  },
  {
    "message": "All conditioned things are impermanent — when one sees this with wisdom, one turns away from suffering. This is the path to purification.",
    "citation": "Maggavagga: The Path"
  },
  {
    "message": "Good is virtue until life's end, good is faith that is steadfast, good is the acquisition of wisdom, and good is the avoidance of evil.",
    "citation": "Nagavagga: The Elephant"
  },
  {
    "message": "He who has renounced violence towards all living beings, weak or strong, who neither kills nor causes others to kill — him do I call a holy man.",
    "citation": "Brahmanavagga: The Holy Man"
  },
  {
    "message": "He who is friendly amidst the hostile, peaceful amidst the violent, and unattached amidst the attached — him do I call a holy man.",
    "citation": "Brahmanavagga: The Holy Man"
  },
  {
    "message": "Speak only the speech that neither torments self nor does harm to others. That speech is truly well spoken.",
    "citation": "Subhasita Sutta: Well-Spoken"
  },
  {
    "message": "To have much learning, to be skillful in handicraft, well-trained in discipline, and to be of good speech — this is the greatest blessing.",
    "citation": "Maha-mangala Sutta: Blessings"
  },
  {
    "message": "To support mother and father, to cherish wife and children, and to be engaged in peaceful occupation — this is the greatest blessing.",
    "citation": "Maha-mangala Sutta: Blessings"
  },
  {
    "message": "Not to associate with the foolish, but to associate with the wise; and to honor those who are worthy of honor — this is the greatest blessing.",
    "citation": "Maha-mangala Sutta: Blessings"
  },
  {
    "message": "Just as a mother would protect her only child with her life even so let one cultivate a boundless love towards all beings.",
    "citation": "Karaniya Metta Sutta: The Discourse on Loving-kindness"
  },
  {
    "message": "Let him radiate boundless love towards the entire world — above, below, and across — unhindered, without ill will, without enmity.",
    "citation": "Karaniya Metta Sutta: The Discourse on Loving-kindness"
  },
  {
    "message": "We will develop and cultivate the liberation of mind by lovingkindness, make it our vehicle, make it our basis, stabilize it, exercise ourselves in it, and fully perfect it.",
    "citation": "Samyutta Nikaya"
  },
  {
    "message": "Think not lightly of good, saying, \"It will not come to me.\" Drop by drop is the water pot filled. Likewise, the wise man, gathering it little by little, fills himself with good.",
    "citation": "Papavagga: Evil"
  },
  {
    "message": "In this manner the world is afflicted by death and decay. But the wise do not grieve, having realized the nature of the world.",
    "citation": "Sutta Nipata"
  },
  {
    "message": "Hatred is never appeased by hatred in this world. By non-hatred alone is hatred appeased. This is a law eternal.",
    "citation": "Yamakavagga: Pairs"
  },
  {
    "message": "If a man going down into a river, swollen and swiftly flowing, is carried away by the current — how can he help others across",
    "citation": "Nava Sutta: The Simile of the Boat"
  },
  {
    "message": "... they blame those who remain silent, they blame those who speak much, they blame those who speak in moderation. There is none in the world who is not blamed.",
    "citation": "Kodhavagga: Anger"
  },
  {
    "message": "If with a pure mind a person speaks or acts happiness follows him like his never-departing shadow.",
    "citation": "Acharya Buddharakkhita"
  },
  {
    "message": "Just as a solid rock is not shaken by the storm, even so the wise are not affected by praise or blame.",
    "citation": "Panditavagga: The Wise"
  },
  {
    "message": "The earth's sprinkled\n with rain, wind\n  is blowing, lightning\n wanders the sky,\n but my thoughts are stilled,\n well-centered\n my mind.",
    "citation": "Vimala (Thag 1.50) "
  },
  {
    "message": "Whatever living creatures there be, Without exception, weak or strong, Long, huge or middle-sized, Or short, minute or bulky, Whether visible or invisible, And those living far or near, The born and those seeking birth, May all beings be happy!",
    "citation": "Karaniya Metta Sutta: The Hymn of Universal Love"
  },
  {
    "message": "May rather skin, sinews and bones wither away, may the flesh and blood of my body dry up: I shall not give up my efforts so long as I have not attained whatever is attainable by manly perseverance, energy and endeavor!",
    "citation": "Appativana Sutta"
  },
  {
    "message": "When the crowded Vietnamese refugee boats met with storms or pirates, if everyone panicked all would be lost. But if even one person on the boat remained calm and centered, it was enough. It showed the way for everyone to survive.",
    "citation": "Thich Nhat Hanh"
  },
  {
    "message": "Letting go gives us freedom, and freedom is the only condition for happiness. If, in our heart, we still cling to anything—anger, anxiety, or possessions—we cannot be free.",
    "citation": "Thich Nhat Hanh, The Heart of the Buddha's Teaching: Transforming Suffering into Peace, Joy, and Liberation"
  },
  {
    "message": "Many people think excitement is happiness...But when you are excited you are not peaceful. True happiness is based on peace.",
    "citation": "Thich Nhat Hanh, The Art of Power"
  },
  {
    "message": "Breathing in, I calm body and mind. Breathing out, I smile. Dwelling in the present moment I know this is the only moment.",
    "citation": "Thich Nhat Hanh, Being Peace"
  },
  {
    "message": "If you love someone but rarely make yourself available to him or her, that is not true love.",
    "citation": "Thich Nhat Hanh, Living Christ"
  },
  {
    "message": "Hope is important because it can make the present moment less difficult to bear. If we believe that tomorrow will be better, we can bear a hardship today.",
    "citation": "Thich Nhat Hanh, Peace Is Every Step: The Path of Mindfulness in Everyday Life"
  },
  {
    "message": "For things to reveal themselves to us, we need to be ready to abandon our views about them.",
    "citation": "Thich Nhat Hanh, Being Peace"
  },
  {
    "message": "When you begin to see that your enemy is suffering, that is the beginning of insight",
    "citation": "Thich Nhat Hanh, Peace Is Every Step: The Path of Mindfulness in Everyday Life"
  },
  {
    "message": "When you love someone, you have to offer that person the best you have. The best thing we can offer another person is our true presence",
    "citation": "Thich Nhat Hanh, No Mud, No Lotus: The Art of Transforming Suffering"
  },
  {
    "message": "We are very good at preparing to live, but not very good at living. We know how to sacrifice ten years for a diploma, and we are willing to work very hard to get a job, a car, a house, and so on. But we have difficulty remembering that we are alive in the present moment, the only moment there is for us to be alive.",
    "citation": "Thich Nhat Hanh, Peace Is Every Step: The Path of Mindfulness in Everyday Life"
  },
  {
    "message": "Anxiety, the illness of our time, comes primarily from our inability to dwell in the present moment.",
    "citation": "Thich Nhat Hanh, The Heart of the Buddha’s Teaching: Transforming Suffering into Peace, Joy, and Liberation"
  },
  {
    "message": "The most basic condition for happiness is freedom. Here we do not mean political freedom, but freedom from the mental formations of anger, despair, jealousy, and delusion... As long as these poisons are still in our heart, happiness cannot be possible.",
    "citation": "Thich Nhat Hanh, Anger: Buddhist Wisdom for Cooling the Flames"
  },
  {
    "message": "You have to realize that happiness is not something you find at the end of the road. You have to understand that it is here, now.",
    "citation": "Thich Nhat Hanh, You Are Here: Discovering the Magic of the Present Moment"
  },
  {
    "message": "The truth is the truth, whether or not it is accepted by the majority. Therefore, I tell you children, it takes great courage to stand up for and protect what is right.",
    "citation": "Thich Nhat Hanh, Old Path White Clouds: Walking in the Footsteps of the Buddha"
  },
  {
    "message": "The mind is like a crazy monkey, which leaps about and never stays in one place. It is completely restless and constantly paranoid about its surroundings. The training, or the meditation practice, is a way to catch this monkey, to begin with. That is the starting point.",
    "citation": "Chogyam Trungpa, The Teacup & the Skullcup: Chogyam Trungpa on Zen and Tantra"
  },
  {
    "message": "Everything that occurs is not only usable and workable but is actually the path itself. We can use everything that happens to us as the means for waking up. We can use everything that occurs — whether it’s our conflicting emotions and thoughts or our seemingly outer situation — to show us where we are asleep and how we can wake up completely, utterly, without reservations.",
    "citation": "Pema Chödron, The Pocket Pema Chödron"
  },
  {
    "message": "When you are practicing Zazen, do not try to stop your thinking. Let it stop by itself. If something comes into your mind, let it come in, and let it go out. It will not stay long. When you try to stop your thinking, it means you are bothered by it. Do not be bothered by anything. It appears as if something comes from outside your mind, but actually it is only the waves of your mind, and if you are not bothered by the waves, gradually they will become calmer and calmer.",
    "citation": "Shunryu Suzuki, Zen Mind, Beginner's Mind"
  },
  {
    "message": "Leave your front door and your back door open. Allow your thoughts to come and go. Just don’t serve them tea.",
    "citation": "Shunryu Suzuki, quoted by David Chadwick, Crooked Cucumber: The Life and Zen Teaching of Shunryu Suzuk"
  },
  {
    "message": "Who is the enemy? Ignorance, anger, attachment, and pride are the ultimate enemies; they are not outside, but within, and must be fought with the weapons of wisdom and meditative concentration.",
    "citation": "His Holiness the 14th Dalai Lama, The Dalai Lama's Little Book o Inner Peace: The Essential Life and Teachings"
  },
  {
    "message": "There is nothing amazing about being highly educated; there is nothing amazing about being rich. Only when the individual has a warm heart do these attributes become worthwhile.",
    "citation": "His Holiness the 14th Dalai Lama, Ancient Wisdom; Modern World"
  },
  {
    "message": "If we ourselves remain angry and then sing world peace, it has little meaning. First, our individual self must learn peace. This we can practice. Then we can teach the rest of the world.",
    "citation": "His Holiness the 14th Dalai Lama, My Tibet, Text by his Holiness the Fourteenth Dalai Lama of Tibet"
  },
  {
    "message": "When one does not understand death, life can be very confusing.",
    "citation": "Ajahn Chah"
  },
  {
    "message": "All the things taking place around our world, all the irritations and all the problems, are crucial. Without others we cannot attain enlightenment — in fact, we cannot even tread on the path. If there is no noise outside during our sitting meditation, we cannot develop mindfulness. If we do not have aches and pains in the body, we cannot attain mindfulness; we cannot actually meditate. If everything were lovey-dovey and jellyfishlike, there would be nothing to work with.",
    "citation": "Chögyam Trungpa, Training the Mind and Cultivating Loving-Kindness"
  },
  {
    "message": "All the things taking place around our world, all the irritations and all the problems, are crucial. Without others we cannot attain enlightenment — in fact, we cannot even tread on the path. If there is no noise outside during our sitting meditation, we cannot develop mindfulness. If we do not have aches and pains in the body, we cannot attain mindfulness; we cannot actually meditate. If everything were lovey-dovey and jellyfishlike, there would be nothing to work with.",
    "citation": "Chögyam Trungpa, Training the Mind and Cultivating Loving-Kindness"
  },
  {
    "message": "Real flowers are much more beautiful than plastic ones, in part because of their impermanence. People appreciate the seasons, the autumn and the spring, because the seasons are a process of change. Each season is a precious time. In this way, impermanence is beauty.",
    "citation": "Chögyam Trungpa, Mindfulness in Action: Making Friends with Yourself through Meditation and Everyday Awareness"
  },
  {
    "message": "An emotion is like a cloud passing through the sky. Sometimes it is fear or anger, sometimes it is happiness or love, sometimes it is compassion. But none of them ultimately constitute a self. They are just what they are, each manifesting its own quality. With this understanding, we can cultivate the emotions that seem helpful and simply let the others be, without aversion, without suppression, without identification.",
    "citation": "Joseph Goldstein, Insight Meditation: The Practice of Freedom"
  },
  {
    "message": "We can also strengthen the quality of ardor by reflecting on the transiency of all phenomena. Look at all the things we become attached to, whether they are people or possessions or feelings or conditions of the body. Nothing we have, no one in our lives, no state of mind is exempt from change. Nothing at all can prevent the universal process of birth, growth, decay, and death.",
    "citation": "Joseph Goldstein, Mindfulness: A Practical Guide to Awakening"
  },
  {
    "message": "All things arise when the appropriate conditions are present, and all things pass away as conditions change. Behind the process, there is no “self” who is running the show.",
    "citation": "Joseph Goldstein, Mindfulness: A Practical Guide to Awakening"
  },
  {
    "message": "The tremendous danger is that this belief – that genuine happiness comes only from pleasant feelings – becomes a strong motivation to stay closed to anything unpleasant. But by staying closed to all unpleasantness, we also stay closed to our own wellspring of compassion.",
    "citation": "Joseph Goldstein, A Heart Full Of Peace"
  },
  {
    "message": "All things move and change and are impermanent like clouds, They may be likened to a flash of lightning. They are like a dewdrop on a blade of grass, and deceptive like an empty fist; They have no essence and no self, and lack intrinsic existence in every way.",
    "citation": "Buddha, The Play in Full (Lalitavistara)"
  },
  {
    "message": "With even a little intuitive wisdom we will be able to see clearly the ways of the world. We will come to understand that everything in the world is our teacher.",
    "citation": "Ajahn Chah"
  },
  {
    "message": "By happiness I mean here a deep sense of flourishing that arises from an exceptionally healthy mind. This is not a mere pleasurable feeling, a fleeting emotion, or a mood, but an optimal state of being. Happiness is also a way of interpreting the world, since while it may be difficult to change the world, it is always possible to change the way we look at it.",
    "citation": "Matthieu Ricard, The Skill of Happiness"
  },
  {
    "message": "If I could not be peaceful in the midst of danger, then the kind of peace I might have in simpler times is meaningless. If I could not find peace in the midst of difficulty, I knew I would never know real peace.",
    "citation": "Thich Nhat Hanh, At Home in the World: Stories and Essential Teachings from a Monk's Life"
  },
  {
    "message": "The future is made up of only one substance and that is the present moment. By taking care of the present, you are doing everything you can to assure a good future.",
    "citation": "Thich Nhat Hanh, Creating True Peace: Ending Violence in Yourself, Your Family, Your Community, and the World"
  },
  {
    "message": "A meditator incapable of diligence, like a king without bodyguards, is an easy target for his enemies, laziness and the negative emotions. The battle of liberation is about to be lost. Put on the armor of diligence without delay, and do battle with indolence.",
    "citation": "Dilgo Khyentse Rinpoche, The Hundred Verses of Advice: Tibetan Buddhist Teachings on What Matters Most"
  },
  {
    "message": "Don’t hope for a life without problems. An easy life results in a judgmental and lazy mind. So an ancient once said, “Accept the anxieties and difficulties of this life.",
    "citation": "Kyong Ho, Thousand Peaks: Korean Zen - Tradition and Teachers"
  },
  {
    "message": "Who is the enemy? Ignorance, anger, attachment, and pride are the ultimate enemies; they are not outside, but within, and must be fought with the weapons of wisdom and meditative concentration.",
    "citation": "His Holiness the 14th Dalai Lama, The Dalai Lama's Little Book of Inner Peace: The Essential Life and Teachings"
  },
  {
    "message": "When we hold on to our opinions with aggression, no matter how valid our cause, we are simply adding more aggression to the planet, and violence and pain increase. Cultivating nonaggression is cultivating peace. The way to stop the war is to stop hating the enemy. It starts with seeing our opinions of ourselves and of others as simply our take on reality and not making them a reason to increase the negativity on the planet.",
    "citation": "Pema Chödron, When Things Fall Apart: Heart Advice for Difficult Times"
  },
  {
    "message": "Discard all lingering doubts, and strive with dedication in your practice. Thoroughly relinquish sloth, mental dullness, and laziness, and strive always with joyful perseverance.",
    "citation": "Atisha, Essential Mind Training by Thupten Jinpa"
  },
  {
    "message": "When pure gold is covered by dirt it is not obvious that it is gold, even though this dirt is temporary. But once it is removed we realize that the gold is gold. In the same way, when our confusion is purified, the wisdom which is our basic wakefulness is made manifest.",
    "citation": "Tulku Urgyen Rinpoche, Repeating the Words of the Buddha"
  },
  {
    "message": "When the mind is at peace, the world too is at peace. Nothing real, nothing absent. Not holding on to reality, not getting stuck in the void, you are neither holy nor wise, just an ordinary person who has completed their work.",
    "citation": "Layman Pang, The Enlightened Heart: An Anthology of Sacred Poetry by Stephen Mitchell"
  },
  {
    "message": "You exist as an idea in your mind.",
    "citation": "Shunryu Suzuki, Seeds for a Boundless Life: Zen Teachings from the Heart by Zenkei Blanche Hartman and Zenju Earthlyn Manuel"
  },
  {
    "message": "Flowers fall with our attachment, and weeds spring up with our aversion.",
    "citation": "Dogen Zenji, Bringing Home the Dharma: Awakening Right Where You Are by Jack Kornfield"
  },
  {
    "message": "When there are thoughts, mental images or perceptions, the usual habit is simply to lose control and be caught up in the show. We continually get absorbed in what is going on, instead of taking a good clear look at the perceiving mind.",
    "citation": "Thrangu Rinpoche, Crystal Clear: Practical Advice for Mahamudra Meditators by Khenchen Thrangu Rinpoche"
  }
]
